# ExternalResourceSubFolder Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceSubFolder Constructor
ExternalResourceSubFolder Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalResourceSubFolder()()()() | Constructs a new ExternalResourceSubFolder with default values for folder name and icon path. |
| ExternalResourceSubFolder(String, String) | Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path. |

# See Also
ExternalResourceSubFolder Class
ExternalResourceSubFolder Members
Autodesk.Revit.DB Namespace